12/data/attachments/ae0ea1eb18993e6e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cd858865-2cf8-4dd2-bca7-fd02ca950a17</nif:username>
            <nif:friendToBeAdded>Jamie_me_Friend_56772_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>